pullead/esp32-hifi/src/settings.h
const Pins RGB_PINS = { // SUNTON 7"
    .b0 = 15, .b1 = 7, .b2 = 6, .b3 = 5, .b4 = 4, .g0 = 9, .g1 = 46, .g2 = 3, .g3 = 8, .g4 = 16, .g5 = 1, .r0 = 14, .r1 = 21, .r2 = 47, .r3 = 48, .r4 = 45, .hsync = 39, .vsync = 40, .de = 41, .pclk = 42, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 10000000, .hsync_pulse_width = 30, .hsync_back_porch = 16, .hsync_front_porch = 210, .vsync_pulse_width = 13, .vsync_back_porch = 10, .vsync_front_porch = 22};

        #define TP_IRQ             -1
        #define SD_MMC_CMD         11
        #define SD_MMC_CLK         12
        #define SD_MMC_D0          13
        #define I2S_DOUT           17
        #define I2S_BCLK           0
        #define I2S_LRC            18
        #define I2S_MCLK           -1 // important!
        #define IR_PIN             38 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins
        #define TFT_BL             2  // same as RGB_PINS.bl
        #define I2C_SDA            19 // I2C, data line for capacitive touchpad and light sensor (-1 if not available)
        #define I2C_SCL            20 // I2C, clock line for capacitive touchpad and light sensor (-1 if not available)
        #define AMP_ENABLED        -1 // onboard amplifier (-1 if not available)
    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 ELECROW 5"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_WZ8048C050
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 7
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

const Pins RGB_PINS = { // ELECROW 5"
    .b0 = 8, .b1 = 3, .b2 = 46, .b3 = 9, .b4 = 1, .g0 = 5, .g1 = 6, .g2 = 7, .g3 = 15, .g4 = 16, .g5 = 4, .r0 = 45, .r1 = 48, .r2 = 47, .r3 = 21, .r4 = 14, .hsync = 39, .vsync = 41, .de = 40, .pclk = 0, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 11000000, .hsync_pulse_width = 4, .hsync_back_porch = 43, .hsync_front_porch = 8, .vsync_pulse_width = 4, .vsync_back_porch = 12, .vsync_front_porch = 8};

        #define TP_IRQ     -1
        #define SD_MMC_CMD 11
        #define SD_MMC_CLK 12
        #define SD_MMC_D0  13

        #define I2C_MASTER_FREQ_HZ 400000 // 400 kHz I2C-frequency

        #define I2S_DOUT 17
        #define I2S_BCLK 42
        #define I2S_LRC  18
        #define I2S_MCLK -1 // important!

        #define IR_PIN             38 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_LINK    -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins

        #define TFT_BL      2  // same as RGB_PINS.bl
        #define AMP_ENABLED -1 // control pin for extenal amplifier (if available)

        #define I2C_SDA 19 // dala line for capacitive touchpadand and light sensor  (-1 if not used)
        #define I2C_SCL 20 // clock line for capacitive touchpad  and light sensor (-1 if not used)

    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 ELECROW 7"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_DIS08070H
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 7
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1

const Pins RGB_PINS = { // ELECROW 7"
    .b0 = 15, .b1 = 7, .b2 = 6, .b3 = 5, .b4 = 4, .g0 = 9, .g1 = 46, .g2 = 3, .g3 = 8, .g4 = 16, .g5 = 1, .r0 = 14, .r1 = 21, .r2 = 47, .r3 = 48, .r4 = 45, .hsync = 39, .vsync = 40, .de = 41, .pclk = 0, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 11000000, .hsync_pulse_width = 4, .hsync_back_porch = 160, .hsync_front_porch = 1, .vsync_pulse_width = 4, .vsync_back_porch = 140, .vsync_front_porch = 1};

        #define TP_IRQ             -1
        #define SD_MMC_CMD         11
        #define SD_MMC_CLK         12
        #define SD_MMC_D0          13
        #define I2S_DOUT           17
        #define I2S_BCLK           42
        #define I2S_LRC            18
        #define I2S_MCLK           -1 // important!
        #define IR_PIN             38 // IR Receiver (if available)
        #define BT_EMITTER_RX      -1 // must be -1, not enough pins
        #define BT_EMITTER_TX      -1 // must be -1, not enough pins
        #define BT_EMITTER_LINK    -1 // must be -1, not enough pins
        #define BT_EMITTER_MODE    -1 // must be -1, not enough pins
        #define BT_EMITTER_CONNECT -1 // must be -1, not enough pins
        #define TFT_BL             2  // same as RGB_PINS.bl
        #define AMP_ENABLED        -1 // control pin for extenal amplifier (if available)
        #define I2C_SDA            19 // I2C, data line for capacitive touchpad and light sensor (-1 if not available)
        #define I2C_SCL            20 // I2C, clock line for capacitive touchpad and light sensor (-1 if not available)
    #endif
#endif // CONFIG_IDF_TARGET_ESP32S3

// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
// 📌📌📌  DISPLAY [800x480] ESP32-S3 WAVESHARE 7"   📌📌📌
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
#if (CONFIG_IDF_TARGET_ESP32S3 == 1)
    #ifdef ESP32_S3_Touch_LCD7
        #undef TFT_CONTROLLER
        #define TFT_CONTROLLER 7
        #undef TFT_ROTATION
        #define TFT_ROTATION 2
        #undef TP_CONTROLLER
        #define TP_CONTROLLER 7
        #undef TP_ROTATION
        #define TP_ROTATION 1
const Pins RGB_PINS = { // WAVESHARE
    .b0 = 14, .b1 = 38, .b2 = 18, .b3 = 17, .b4 = 10, .g0 = 39, .g1 = 0, .g2 = 45, .g3 = 48, .g4 = 47, .g5 = 21, .r0 = 1, .r1 = 2, .r2 = 42, .r3 = 41, .r4 = 40, .hsync = 46, .vsync = 3, .de = 5, .pclk = 7, .bl = -1};

const Timing RGB_TIMING = {.h_res = 800, .v_res = 480, .pixel_clock_hz = 13000000, .hsync_pulse_width = 1, .hsync_back_porch = 1, .hsync_front_porch = 1, .vsync_pulse_width = 4, .vsync_back_porch = 4, .vsync_front_porch = 4};

        #define TP_IRQ -1

        #define SD_MMC_CMD 11
        #define SD_MMC_CLK 12
        #define SD_MMC_D0  13

