pullead/esp32-hifi/src/settings.h
        #define SD_MMC_D0  39
        #define SD_MMC_D1  40
        #define SD_MMC_D2  41
        #define SD_MMC_D3  42
        #define SD_MMC_CLK 43
        #define SD_MMC_CMD 44

        // I2S external DAC
        #define I2S_DOUT 29 // DIN pin - DAC      (-1 if not available)
        #define I2S_BCLK 30 // BCK pin - DAC      (-1 if not available)
        #define I2S_LRC  31 // LCK LRCK pin - DAC (-1 if not available)
        #define I2S_MCLK -1

    // I2S onboard DAC ES8311
    // #define I2S_DOUT  9 // ES8311 DSDIN
    // #define I2S_BCLK 12 // ES8311 SCLK
    // #define I2S_LRC  10 // ES8311 LRCK
    // #define I2S_MCLK 13 // ES8311 MCLK

        #define IR_PIN             33 // IR Receiver                           (-1 if not available)
        #define BT_EMITTER_RX      32 // RX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_TX      28 // TX pin - KCX Bluetooth Transmitter    (-1 if not available)
        #define BT_EMITTER_LINK    34 // high connected - low pairing status   (-1 if not available)
        #define BT_EMITTER_MODE    35 // high transmit - low receive           (-1 if not available)
        #define BT_EMITTER_CONNECT 49 // high impulse -> awake after POWER_OFF (-1 if not available)

        #define LCD_RESET   5  // see schematics JC4880P443
        #define TFT_BL      23 // see schematics JC4880P443
        #define AMP_ENABLED 11 // control pin for amplifier

        #define I2C_SDA 7 // I2C data line for capacitive touchpad
        #define I2C_SCL 8 // I2C clock line for capacitive touchpad
    #endif
#endif
